# Chapter 2.판다스

## 2. 데이터 저장 및 불러오기

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "메뉴" :['아메리카노', '카페라떼', '카페모카', '카푸치노','에스프레소','밀크티','녹차'],
    "가격" : [4500, 5000,5500, 5000, 4000,5900,5300],
    "칼로리" : [10,110,250, 110, 20, 210, 0],
})
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

## 3. 탐색적 데이터 분석(EDA)

In [3]:
df.sample(3)

     메뉴    가격  칼로리
5   밀크티  5900  210
2  카페모카  5500  250
1  카페라떼  5000  110

In [5]:
df.shape

(7, 3)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 296.0+ bytes

In [6]:
df.corr(numeric_only=True)

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

In [7]:
df_car = pd.DataFrame({
    "car" :['Sedan','SUV','Sedan','SUV','SUV','SUV','Sedan','Sedan','Sedan','Sedan','Sedan'],
    "size" : ['S','M','S','S','M','M','L','S','S','M','S']
})
df_car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [8]:
print(df_car['car'].value_counts())
print(df_car['size'].value_counts())

car
Sedan    7
SUV      4
Name: count, dtype: int64
size
S    6
M    4
L    1
Name: count, dtype: int64

In [12]:
df.describe()

                가격         칼로리
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [14]:
df_car.describe(include="O")

          car size
count      11   11
unique      2    3
top     Sedan    S
freq        7    6

## 4. 자료형 변환

In [18]:
data = {
    "메뉴" :['아메리카노', '카페라떼', '카페모카', '카푸치노','에스프레소','밀크티','녹차'],
    "가격" : [4500.0, 5000.0, 5500.0 , 5000.0, 4000.0,5900.0,5300.0],
    "칼로리" : ['10','110','250', '110', '20', '210', '0'],
}
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      float64
 2   칼로리     7 non-null      object
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [19]:
df['가격'] = df['가격'].astype('int')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int32
 2   칼로리     7 non-null      object
dtypes: int32(1), object(2)
memory usage: 268.0+ bytes

In [20]:
df['칼로리'] = df['칼로리'].astype('float')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int32
 2   칼로리     7 non-null      float64
dtypes: float64(1), int32(1), object(1)
memory usage: 268.0+ bytes

## 5. 새로운 칼럼 추가

In [24]:
df = pd.read_csv('cafe.csv')
discount = 0.2
df['할인가'] = df['가격'] * (1-discount)
df.head(2)

      메뉴    가격  칼로리     할인가
0  아메리카노  4500   10  3600.0
1   카페라떼  5000  110  4000.0

## 6. 데이터 삭제

In [25]:
print(df.head(3))
df.drop(1,axis=0,inplace= True)
df.head(3)

      메뉴    가격  칼로리     할인가
0  아메리카노  4500   10  3600.0
1   카페라떼  5000  110  4000.0
2   카페모카  5500  250  4400.0

      메뉴    가격  칼로리     할인가
0  아메리카노  4500   10  3600.0
2   카페모카  5500  250  4400.0
3   카푸치노  5000  110  4000.0

In [26]:
df = df.drop('칼로리', axis = 1)
df.head(3)

      메뉴    가격     할인가
0  아메리카노  4500  3600.0
2   카페모카  5500  4400.0
3   카푸치노  5000  4000.0

In [27]:
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

## 7. 인덱스/슬라이싱(loc)

In [30]:
print(df.loc[0])
df.loc[1, "가격"]

메뉴     아메리카노
가격      4500
칼로리       10
Name: 0, dtype: object

5000

In [33]:
print(df.loc[2,"메뉴":"칼로리"])
df.loc[2,["메뉴", "칼로리"]]

메뉴     카페모카
가격     5500
칼로리     250
Name: 2, dtype: object

메뉴     카페모카
칼로리     250
Name: 2, dtype: object

## 8. 인덱스/슬라이싱(iloc)

In [2]:
df = pd.read_csv('cafe.csv')
df = df.drop(0, axis = 0)
df.head(2)

     메뉴    가격  칼로리
1  카페라떼  5000  110
2  카페모카  5500  250

In [3]:
print(df.iloc[0])
print(df.loc[0])

메뉴     카페라떼
가격     5000
칼로리     110
Name: 1, dtype: object

KeyError: 0

In [4]:
df.iloc[1:3]

     메뉴    가격  칼로리
2  카페모카  5500  250
3  카푸치노  5000  110

In [5]:
df.loc[2:3]

     메뉴    가격  칼로리
2  카페모카  5500  250
3  카푸치노  5000  110

## 9. 데이터 추가 / 변경

In [2]:
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [3]:
import numpy as np
df['원산지'] = np.nan
df

      메뉴    가격  칼로리  원산지
0  아메리카노  4500   10  NaN
1   카페라떼  5000  110  NaN
2   카페모카  5500  250  NaN
3   카푸치노  5000  110  NaN
4  에스프레소  4000   20  NaN
5    밀크티  5900  210  NaN
6     녹차  5300    0  NaN

In [4]:
df.loc[0,"원산지"] = '콜롬비아'
df.loc[2:3, "원산지"] = '과테말라'
df.head(4)

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라

In [5]:
df.loc['시즌'] = ['크리스마스라떼', 6000, 300, '한국']
df.tail(3)

         메뉴    가격  칼로리  원산지
5       밀크티  5900  210  NaN
6        녹차  5300    0  NaN
시즌  크리스마스라떼  6000  300   한국

In [6]:
df.loc[7] = {'메뉴' : '딴짓커피', '가격' : 2000, '칼로리' : 20}
df.tail(3)

         메뉴    가격  칼로리  원산지
6        녹차  5300    0  NaN
시즌  크리스마스라떼  6000  300   한국
7      딴짓커피  2000   20  NaN

## 10. 정렬

In [10]:
df = pd.read_csv('cafe2.csv')
df.sort_index(ascending = False)

      메뉴    가격  칼로리   원산지
7   딴짓커피  2000   20   NaN
6     녹차  5300    0   NaN
5    밀크티  5900  210   NaN
4  에스프레소  4000   20   NaN
3   카푸치노  5000  110  과테말라
2   카페모카  5500  250  과테말라
1   카페라떼  5000  110   NaN
0  아메리카노  4500   10  콜롬비아

In [11]:
df.sort_values('메뉴', ascending = False)

      메뉴    가격  칼로리   원산지
3   카푸치노  5000  110  과테말라
2   카페모카  5500  250  과테말라
1   카페라떼  5000  110   NaN
4  에스프레소  4000   20   NaN
0  아메리카노  4500   10  콜롬비아
5    밀크티  5900  210   NaN
7   딴짓커피  2000   20   NaN
6     녹차  5300    0   NaN

In [12]:
df = df.sort_values(['가격', '메뉴'], ascending = [False, True])
df

      메뉴    가격  칼로리   원산지
5    밀크티  5900  210   NaN
2   카페모카  5500  250  과테말라
6     녹차  5300    0   NaN
1   카페라떼  5000  110   NaN
3   카푸치노  5000  110  과테말라
0  아메리카노  4500   10  콜롬비아
4  에스프레소  4000   20   NaN
7   딴짓커피  2000   20   NaN

In [14]:
df.reset_index(drop=True)

      메뉴    가격  칼로리   원산지
0    밀크티  5900  210   NaN
1   카페모카  5500  250  과테말라
2     녹차  5300    0   NaN
3   카페라떼  5000  110   NaN
4   카푸치노  5000  110  과테말라
5  아메리카노  4500   10  콜롬비아
6  에스프레소  4000   20   NaN
7   딴짓커피  2000   20   NaN

## 11. 필터링

In [3]:
df = pd.read_csv('cafe2.csv')
df.head(2)

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN

In [4]:
cond = df['칼로리'] < 50
df[cond]

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
4  에스프레소  4000   20   NaN
6     녹차  5300    0   NaN
7   딴짓커피  2000   20   NaN

In [5]:
df[df['칼로리']<50]

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
4  에스프레소  4000   20   NaN
6     녹차  5300    0   NaN
7   딴짓커피  2000   20   NaN

In [6]:
df[~cond]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라
5   밀크티  5900  210   NaN

In [7]:
cond1 = df['가격'] >= 5000
cond2 = df['칼로리'] > 100
print(df[cond1&cond2])
df[cond1|cond2]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라
5   밀크티  5900  210   NaN

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라
5   밀크티  5900  210   NaN
6    녹차  5300    0   NaN

In [13]:
cond1 = (df['원산지'] == "과테말라")
cond2 = df['가격'] <= 5000
df[cond1 & cond2]

     메뉴    가격  칼로리   원산지
3  카푸치노  5000  110  과테말라

In [15]:
df['메뉴'].isin(['녹차'])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
Name: 메뉴, dtype: bool

In [16]:
cond = df['메뉴'].isin(['녹차'])
df[cond]

   메뉴    가격  칼로리  원산지
6  녹차  5300    0  NaN

In [17]:
box = ['녹차', '카푸치노', '카페라떼']
cond = df['메뉴'].isin(box)
df[cond]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
3  카푸치노  5000  110  과테말라
6    녹차  5300    0   NaN

## 12. 결측치 처리

In [23]:
df = pd.read_csv('cafe2.csv')
print(df.isnull().sum())
print(df.isna().sum())
df.isnull()

메뉴     0
가격     0
칼로리    0
원산지    5
dtype: int64
메뉴     0
가격     0
칼로리    0
원산지    5
dtype: int64

      메뉴     가격    칼로리    원산지
0  False  False  False  False
1  False  False  False   True
2  False  False  False  False
3  False  False  False  False
4  False  False  False   True
5  False  False  False   True
6  False  False  False   True
7  False  False  False   True

In [24]:
df['원산지'].fillna('코스타리카',inplace = True)
df

      메뉴    가격  칼로리    원산지
0  아메리카노  4500   10   콜롬비아
1   카페라떼  5000  110  코스타리카
2   카페모카  5500  250   과테말라
3   카푸치노  5000  110   과테말라
4  에스프레소  4000   20  코스타리카
5    밀크티  5900  210  코스타리카
6     녹차  5300    0  코스타리카
7   딴짓커피  2000   20  코스타리카

In [25]:
df.to_csv('cafe3.csv',index = False)

## 13. 값 변경

In [29]:
df = pd.read_csv('cafe3.csv')
df.replace('아메리카노', '룽고', inplace = True)
df.replace('녹차', '그린티', inplace = True)
df

      메뉴    가격  칼로리    원산지
0     룽고  4500   10   콜롬비아
1   카페라떼  5000  110  코스타리카
2   카페모카  5500  250   과테말라
3   카푸치노  5000  110   과테말라
4  에스프레소  4000   20  코스타리카
5    밀크티  5900  210  코스타리카
6    그린티  5300    0  코스타리카
7   딴짓커피  2000   20  코스타리카

In [34]:
change = {'룽고' : '아메리카노', '그린티': '녹차'}
df.replace(change, inplace = True)
df

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20  코스타리카     NaN
5    밀크티  5900  210  코스타리카     NaN
6     녹차  5300    0   대한민국     NaN
7   딴짓커피  2000   20  코스타리카     NaN

In [35]:
df.loc[6,'원산지'] = '대한민국'
df.loc[1:2,'이벤트가'] = 1000
df.to_csv('cafe4.csv', index = False)
df

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20  코스타리카     NaN
5    밀크티  5900  210  코스타리카     NaN
6     녹차  5300    0   대한민국     NaN
7   딴짓커피  2000   20  코스타리카     NaN

## 14. 문자열

In [2]:
df = pd.DataFrame({'A' : ['데이터 분석', '기본 학습서', '퇴근 후 열공'],
                   'B' : [10, 20, 30],
                   'C' : ['ab cd', 'AB CD', 'ab cd ']})
df['A'] = df['A'].replace('분석', '시각화')
df

         A   B       C
0   데이터 분석  10   ab cd
1   기본 학습서  20   AB CD
2  퇴근 후 열공  30  ab cd

In [3]:
df['A'] = df['A'].str.replace('분석', '시각화')
df

         A   B       C
0  데이터 시각화  10   ab cd
1   기본 학습서  20   AB CD
2  퇴근 후 열공  30  ab cd

In [4]:
df['B'] = df['B'].str.replace(10, 100)
df

AttributeError: Can only use .str accessor with string values!

In [6]:
print(df['A'].str.split())
df['A'].str.split()[0]

0     [데이터, 시각화]
1      [기본, 학습서]
2    [퇴근, 후, 열공]
Name: A, dtype: object

['데이터', '시각화']

In [13]:
df['D']  = df['A'].str.split().str[0]
df

         A   B       C    D
0  데이터 시각화  10   ab cd  데이터
1   기본 학습서  20   AB CD   기본
2  퇴근 후 열공  30  ab cd    퇴근

In [14]:
print(df['A'].str.contains('기본'))
df['기본포함유무'] = df['A'].str.contains('기본')
df

0    False
1     True
2    False
Name: A, dtype: bool

         A   B       C    D  기본포함유무
0  데이터 시각화  10   ab cd  데이터   False
1   기본 학습서  20   AB CD   기본    True
2  퇴근 후 열공  30  ab cd    퇴근   False

In [16]:
menu = pd.Series(['맛난버거 세트', '매운 치킨버거', '더블 치즈버거'])
print(menu.isin(['맛난버거 세트', '더블 치즈버거']))
menu.str.contains('세트')

0     True
1    False
2     True
dtype: bool

0     True
1    False
2    False
dtype: bool

In [17]:
df['문자길이'] = df['A'].str.len()
df

         A   B       C    D  기본포함유무  문자길이
0  데이터 시각화  10   ab cd  데이터   False     7
1   기본 학습서  20   AB CD   기본    True     6
2  퇴근 후 열공  30  ab cd    퇴근   False     7

In [18]:
df['C'] = df['C'].str.lower()
print(df['C'])
df['C'] = df['C'].str.upper()
print(df['C'])

0     ab cd
1     ab cd
2    ab cd
Name: C, dtype: object
0     AB CD
1     AB CD
2    AB CD
Name: C, dtype: object

In [20]:
print(df['C'] == 'AB CD')
df['C'] = df['C'].str.lower()
df['C'] = df['C'].str.replace(" ", "")
df['C']

0     True
1     True
2    False
Name: C, dtype: bool

0    abcd
1    abcd
2    abcd
Name: C, dtype: object

In [21]:
print(df['C'].str[1:3])
df['C'][1:3]

0    bc
1    bc
2    bc
Name: C, dtype: object

1    abcd
2    abcd
Name: C, dtype: object

## 15. 내장 함수

In [22]:
df = pd.read_csv('cafe4.csv')
print(len(df))
print(df.shape[0])

8
8

In [23]:
cond = df['가격'] > 5000
print(sum(cond))
print(len(df[cond]))

3
3

In [24]:
df.sum(numeric_only = True)

가격      37200.0
칼로리       730.0
이벤트가     2000.0
dtype: float64

In [25]:
df.T

          0       1       2     3      4      5     6      7
메뉴    아메리카노    카페라떼    카페모카  카푸치노  에스프레소    밀크티    녹차   딴짓커피
가격     4500    5000    5500  5000   4000   5900  5300   2000
칼로리      10     110     250   110     20    210     0     20
원산지    콜롬비아   코스타리카    과테말라  과테말라  코스타리카  코스타리카  대한민국  코스타리카
이벤트가    NaN  1000.0  1000.0   NaN    NaN    NaN   NaN    NaN

In [26]:
df

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20  코스타리카     NaN
5    밀크티  5900  210  코스타리카     NaN
6     녹차  5300    0   대한민국     NaN
7   딴짓커피  2000   20  코스타리카     NaN

In [27]:
df.sum(axis =1, numeric_only = True)

0    4510.0
1    6110.0
2    6750.0
3    5110.0
4    4020.0
5    6110.0
6    5300.0
7    2020.0
dtype: float64

In [29]:
print(df['가격'].max())
print(df['가격'].min())
print(df['가격'].mean())
print(df['가격'].median())
print(df['가격'].sum())
print(df['가격'].std())
print(df['가격'].var())

5900
2000
4650.0
5000.0
37200
1220.070255588353
1488571.4285714286

In [31]:
print(df['가격'].quantile(0.25))
df['가격'].quantile(0.75)

4375.0

5350.0

In [32]:
cond = df['가격'] < df['가격'].quantile(.25)
print(df[cond])
cond2 = df['가격'] > df['가격'].quantile(0.75)
print(df[cond2])

      메뉴    가격  칼로리    원산지  이벤트가
4  에스프레소  4000   20  코스타리카   NaN
7   딴짓커피  2000   20  코스타리카   NaN
     메뉴    가격  칼로리    원산지    이벤트가
2  카페모카  5500  250   과테말라  1000.0
5   밀크티  5900  210  코스타리카     NaN

In [8]:
df['원산지'].mode()[0]

'코스타리카'

In [9]:
print(df['가격'].idxmax())
max_idx = df['가격'].idxmax()
print(df.loc[max_idx,'메뉴'])
df.loc[max_idx]['메뉴']

5
밀크티

'밀크티'

In [10]:
print(df.nlargest(3,'가격'))
print(df.nsmallest(2,'가격'))

     메뉴    가격  칼로리    원산지    이벤트가
5   밀크티  5900  210  코스타리카     NaN
2  카페모카  5500  250   과테말라  1000.0
6    녹차  5300    0   대한민국     NaN
      메뉴    가격  칼로리    원산지  이벤트가
7   딴짓커피  2000   20  코스타리카   NaN
4  에스프레소  4000   20  코스타리카   NaN

In [15]:
def cal(x) : 
    if x > 100:
        return "No"
    else:
        return "Yes"
df['먹어도 될까요?'] = df['칼로리'].apply(cal)
df

      메뉴    가격  칼로리    원산지    이벤트가 먹어도 될까요?
0  아메리카노  4500   10   콜롬비아     NaN      Yes
1   카페라떼  5000  110  코스타리카  1000.0       No
2   카페모카  5500  250   과테말라  1000.0       No
3   카푸치노  5000  110   과테말라     NaN       No
4  에스프레소  4000   20  코스타리카     NaN      Yes
5    밀크티  5900  210  코스타리카     NaN       No
6     녹차  5300    0   대한민국     NaN      Yes
7   딴짓커피  2000   20  코스타리카     NaN      Yes

In [16]:
df = pd.DataFrame({'Name' : {0:'쿼카', 1:'알파카', 2:'시바견'},
                   '수학' : {0:90, 1:84, 2:85},
                   '영어' : {0:92, 1:84, 2:86},
                   '국어' : {0:91, 1: 94, 2:83},})
df

  Name  수학  영어  국어
0   쿼카  90  92  91
1  알파카  84  84  94
2  시바견  85  86  83

In [17]:
print(pd.melt(df,id_vars=['Name']))
print(pd.melt(df,id_vars=['Name'], value_vars=['수학', '영어']))

  Name variable  value
0   쿼카       수학     90
1  알파카       수학     84
2  시바견       수학     85
3   쿼카       영어     92
4  알파카       영어     84
5  시바견       영어     86
6   쿼카       국어     91
7  알파카       국어     94
8  시바견       국어     83
  Name variable  value
0   쿼카       수학     90
1  알파카       수학     84
2  시바견       수학     85
3   쿼카       영어     92
4  알파카       영어     84
5  시바견       영어     86

In [22]:
df = pd.read_csv('cafe4.csv')
df.groupby(['원산지']).mean(numeric_only=True)

           가격    칼로리    이벤트가
원산지
과테말라   5250.0  180.0  1000.0
대한민국   5300.0    0.0     NaN
코스타리카  4225.0   90.0  1000.0
콜롬비아   4500.0   10.0     NaN

In [23]:
df.groupby(['원산지', '칼로리']).mean(numeric_only = True)

               가격    이벤트가
원산지   칼로리
과테말라  110  5000.0     NaN
      250  5500.0  1000.0
대한민국  0    5300.0     NaN
코스타리카 20   3000.0     NaN
      110  5000.0  1000.0
      210  5900.0     NaN
콜롬비아  10   4500.0     NaN

In [24]:
df.groupby(['원산지', '메뉴']).agg(['mean', 'sum'])

                 가격          칼로리         이벤트가
               mean   sum   mean  sum    mean     sum
원산지   메뉴
과테말라  카페모카   5500.0  5500  250.0  250  1000.0  1000.0
      카푸치노   5000.0  5000  110.0  110     NaN     0.0
대한민국  녹차     5300.0  5300    0.0    0     NaN     0.0
코스타리카 딴짓커피   2000.0  2000   20.0   20     NaN     0.0
      밀크티    5900.0  5900  210.0  210     NaN     0.0
      에스프레소  4000.0  4000   20.0   20     NaN     0.0
      카페라떼   5000.0  5000  110.0  110  1000.0  1000.0
콜롬비아  아메리카노  4500.0  4500   10.0   10     NaN     0.0

In [25]:
df.groupby(['원산지', '칼로리']).mean(numeric_only=True).reset_index()

     원산지  칼로리      가격    이벤트가
0   과테말라  110  5000.0     NaN
1   과테말라  250  5500.0  1000.0
2   대한민국    0  5300.0     NaN
3  코스타리카   20  3000.0     NaN
4  코스타리카  110  5000.0  1000.0
5  코스타리카  210  5900.0     NaN
6   콜롬비아   10  4500.0     NaN

In [26]:
data = {
    'Date1': ['2024-02-17', '2024-02-18', '2024-02-19', '2024-02-20'],
    'Date2': ['2024:02:17', '2024:02:18', '2024:02:19', '2024:02:20'],
    'Date3': ['24/02/17', '24/02/18', '24/02/19', '24/02/20'],
    'Date4': ['02/17/2024', '02/18/2024', '02/19/2024', '02/20/2024'],
    'Date5': ['17-Feb-2024', '18-Feb-2024', '19-Feb-2024', '20-Feb-2024'],
    'DateTime1': ['24-02-17 13:45:30', '24-02-18 14:55:45', '24-02-19 15:30:15', '24-02-20 16:10:50'],
    'DateTime2': ['2024-02-17 13-45-30', '2024-02-18 14-55-45', '2024-02-19 15-30-15', '2024-02-20 16-10-50'],
    'DateTime3': ['02/17/2024 01:45:30 PM', '02/18/2024 02:55:45 PM', '02/19/2024 03:30:15 AM', '02/20/2024 04:10:50 AM'],
    'DateTime4': ['17 Feb 2024 13:45:30', '18 Feb 2024 14:55:45', '19 Feb 2024 15:30:15', '20 Feb 2024 16:10:50']
}

df = pd.DataFrame(data)
df.to_csv("date_data.csv", index=False)
df

,Date1,Date2,Date3,Date4,Date5,DateTime1,DateTime2,DateTime3,DateTime4
0,2024-02-17,2024:02:17,24/02/17,02/17/2024,17-Feb-2024,24-02-17 13:45:30,2024-02-17 13-45-30,02/17/2024 01:45:30 PM,17 Feb 2024 13:45:30
1,2024-02-18,2024:02:18,24/02/18,02/18/2024,18-Feb-2024,24-02-18 14:55:45,2024-02-18 14-55-45,02/18/2024 02:55:45 PM,18 Feb 2024 14:55:45
2,2024-02-19,2024:02:19,24/02/19,02/19/2024,19-Feb-2024,24-02-19 15:30:15,2024-02-19 15-30-15,02/19/2024 03:30:15 AM,19 Feb 2024 15:30:15
3,2024-02-20,2024:02:20,24/02/20,02/20/2024,20-Feb-2024,24-02-20 16:10:50,2024-02-20 16-10-50,02/20/2024 04:10:50 AM,20 Feb 2024 16:10:50

In [27]:
df = pd.read_csv("date_data.csv")
df['Date1'] = pd.to_datetime(df['Date1'])
df['Date2'] = pd.to_datetime(df['Date2'], format='%Y:%m:%d')
df['Date3'] = pd.to_datetime(df['Date3'])
df['Date4'] = pd.to_datetime(df['Date4'])
df['Date5'] = pd.to_datetime(df['Date5'])
df['DateTime1'] = pd.to_datetime(df['DateTime1'])
df['DateTime2'] = pd.to_datetime(df['DateTime2'], format='%Y-%m-%d %H-%M-%S')
df['DateTime3'] = pd.to_datetime(df['DateTime3'])
df['DateTime4'] = pd.to_datetime(df['DateTime4'])
df

C:\Users\user\AppData\Local\Temp\ipykernel_7636\2722885956.py:4: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Date3'] = pd.to_datetime(df['Date3'])
C:\Users\user\AppData\Local\Temp\ipykernel_7636\2722885956.py:7: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['DateTime1'] = pd.to_datetime(df['DateTime1'])
C:\Users\user\AppData\Local\Temp\ipykernel_7636\2722885956.py:9: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['DateTime3'] = pd.to_datetime(df['DateTime3'])

,Date1,Date2,Date3,Date4,Date5,DateTime1,DateTime2,DateTime3,DateTime4
0,2024-02-17,2024-02-17,2017-02-24,2024-02-17,2024-02-17,2017-02-24 13:45:30,2024-02-17 13:45:30,2024-02-17 13:45:30,2024-02-17 13:45:30
1,2024-02-18,2024-02-18,2018-02-24,2024-02-18,2024-02-18,2018-02-24 14:55:45,2024-02-18 14:55:45,2024-02-18 14:55:45,2024-02-18 14:55:45
2,2024-02-19,2024-02-19,2019-02-24,2024-02-19,2024-02-19,2019-02-24 15:30:15,2024-02-19 15:30:15,2024-02-19 03:30:15,2024-02-19 15:30:15
3,2024-02-20,2024-02-20,2020-02-24,2024-02-20,2024-02-20,2020-02-24 16:10:50,2024-02-20 16:10:50,2024-02-20 04:10:50,2024-02-20 16:10:50

In [28]:
df = pd.read_csv("date_data.csv")
df['Date2'] = pd.to_datetime(df['Date2'], format='%Y:%m:%d')
df['Date3'] = pd.to_datetime(df['Date3'], format='%y/%m/%d')
df['DateTime1'] = pd.to_datetime(df['DateTime1'], format='%y-%m-%d %H:%M:%S')
df['DateTime2'] = pd.to_datetime(df['DateTime2'], format='%Y-%m-%d %H-%M-%S')
df[['Date2', 'Date3', 'DateTime1', 'DateTime2']]

       Date2      Date3           DateTime1           DateTime2
0 2024-02-17 2024-02-17 2024-02-17 13:45:30 2024-02-17 13:45:30
1 2024-02-18 2024-02-18 2024-02-18 14:55:45 2024-02-18 14:55:45
2 2024-02-19 2024-02-19 2024-02-19 15:30:15 2024-02-19 15:30:15
3 2024-02-20 2024-02-20 2024-02-20 16:10:50 2024-02-20 16:10:50

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date1      4 non-null      object
 1   Date2      4 non-null      datetime64[ns]
 2   Date3      4 non-null      datetime64[ns]
 3   Date4      4 non-null      object
 4   Date5      4 non-null      object
 5   DateTime1  4 non-null      datetime64[ns]
 6   DateTime2  4 non-null      datetime64[ns]
 7   DateTime3  4 non-null      object
 8   DateTime4  4 non-null      object
dtypes: datetime64[ns](4), object(5)
memory usage: 416.0+ bytes

In [31]:
df['year'] = df['DateTime1'].dt.year
df['month'] = df['DateTime1'].dt.month
df['day'] = df['DateTime1'].dt.day
df['hour'] = df['DateTime1'].dt.hour
df['minute'] = df['DateTime1'].dt.minute
df['second'] = df['DateTime1'].dt.second
df

,Date1,Date2,Date3,Date4,Date5,DateTime1,DateTime2,DateTime3,DateTime4,year,month,day,hour,minute,second
0,2024-02-17,2024-02-17,2024-02-17,02/17/2024,17-Feb-2024,2024-02-17 13:45:30,2024-02-17 13:45:30,02/17/2024 01:45:30 PM,17 Feb 2024 13:45:30,2024,2,17,13,45,30
1,2024-02-18,2024-02-18,2024-02-18,02/18/2024,18-Feb-2024,2024-02-18 14:55:45,2024-02-18 14:55:45,02/18/2024 02:55:45 PM,18 Feb 2024 14:55:45,2024,2,18,14,55,45
2,2024-02-19,2024-02-19,2024-02-19,02/19/2024,19-Feb-2024,2024-02-19 15:30:15,2024-02-19 15:30:15,02/19/2024 03:30:15 AM,19 Feb 2024 15:30:15,2024,2,19,15,30,15
3,2024-02-20,2024-02-20,2024-02-20,02/20/2024,20-Feb-2024,2024-02-20 16:10:50,2024-02-20 16:10:50,02/20/2024 04:10:50 AM,20 Feb 2024 16:10:50,2024,2,20,16,10,50

In [32]:
df['DateTime1'].dt.dayofweek

0    5
1    6
2    0
3    1
Name: DateTime1, dtype: int32

In [33]:
print(df['DateTime1'].dt.to_period('Y'))
print(df['DateTime1'].dt.to_period('Q'))
print(df['DateTime1'].dt.to_period('M'))
print(df['DateTime1'].dt.to_period('D'))
print(df['DateTime1'].dt.to_period('H'))

0    2024
1    2024
2    2024
3    2024
Name: DateTime1, dtype: period[A-DEC]
0    2024Q1
1    2024Q1
2    2024Q1
3    2024Q1
Name: DateTime1, dtype: period[Q-DEC]
0    2024-02
1    2024-02
2    2024-02
3    2024-02
Name: DateTime1, dtype: period[M]
0    2024-02-17
1    2024-02-18
2    2024-02-19
3    2024-02-20
Name: DateTime1, dtype: period[D]
0    2024-02-17 13:00
1    2024-02-18 14:00
2    2024-02-19 15:00
3    2024-02-20 16:00
Name: DateTime1, dtype: period[H]

In [3]:
df = pd.read_csv('date_data.csv', usecols=['DateTime4'], parse_dates = ['DateTime4'])
day = pd.Timedelta(days=99)
df['100day'] = df['DateTime4'] + day
df

            DateTime4              100day
0 2024-02-17 13:45:30 2024-05-26 13:45:30
1 2024-02-18 14:55:45 2024-05-27 14:55:45
2 2024-02-19 15:30:15 2024-05-28 15:30:15
3 2024-02-20 16:10:50 2024-05-29 16:10:50